<?php
/**
 * +----------------------------------------------------------------------
 * 语言包存放地址
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/

// 核心中文语言包
return [
    // 系统语言包
    'start -0' => '欢迎使用 SW-X！',
    'start -1' => '载入命名空间',
    'start -2' => '载入配置文件',
    'start -3' => '载入系统助手函数库',
    'start -4' => '载入应用公共函数库',
    'start -5' => '进入App应用启动项',
    'start -6' => 'Http：初始化路由表',
    'start -7' => 'Http：路由表初始完成',
    'start -8' => '：Swoole正在启动服务',
    'start -9' => '：使用SSL证书',
    'start -10' => '：Swoole-Server实例化成功',
    'start -11' => '：Swoole-Server实例化失败',
    'start -12' => '：Swoole注入配置项',
    'start -13' => 'Swoole-Server启动事件监听',
    'start -14' => 'Swoole-Server事件监听注入完成',
    'start -15' => 'Swoole服务启动成功',
    'start -17' => 'WebSocket：初始化路由表',
    'start -18' => 'WebSocket：路由表初始完成',
    'start -19' => '载入错误异常监听',
    'start -20' => '载入日志模块初始化',
    'route method error' => 'Route：Incorrect request type~',
    'route path error' => 'Route not found~',
    'mysql yes' => 'Db连接池挂载完成',
    'redis yes' => 'Redis连接池挂载完成',
];
