<?php
// +----------------------------------------------------------------------
// | 客户端封装
// +----------------------------------------------------------------------
// | Copyright (c) 2018 https://blog.junphp.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 小黄牛 <1731223728@qq.com>
// +----------------------------------------------------------------------

namespace x;

class Client
{
    /**
     * 调用HTTP请求，可用于代替CURL
     * @todo 无
     * @author 小黄牛
     * @version v1.2.11 + 2020.08.06
     * @deprecated 暂不启用
     * @global 无
     * @return void
    */
    public function http() {
        return new \x\client\Http();
    }
}