<?php
/**
 * +----------------------------------------------------------------------
 * 当Csrf注解校验失败时，系统回调处理的生命周期
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/

namespace box\lifecycle;

class csrf_error
{
    /**
     * 接受回调处理
     * @author 小黄牛
     * @version v1.1.5 + 2020.07.15
     * @param string $tips 错误内容
     * @return bool
    */
    public function run($tips) {
        $obj = new \x\controller\Http();
        $obj->fetch($tips);
        return true;
    }
}