<?php
/**
 * +----------------------------------------------------------------------
 * 当应用层捕捉到Redis连接数小于等于0时，会回调至此
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/

namespace box\lifecycle;

class redis_pop_error
{
    /**
     * 接受回调处理
     * @author 小黄牛
     * @version v1.1.5 + 2020.07.15
     * @param string $type 连接池类型：write
     * @return bool
    */
    public function run($type) {
        // 此处可自行实现消息通知
        echo $type.' Redis 连接数不足！'.PHP_EOL;
        return true;
    }
}