<?php
/**
 * +----------------------------------------------------------------------
 * 当Worker进程Start完成时触发回调，改生命周期只对WorkerID=0有效，不会多次触发
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/

namespace box\lifecycle;

class worker_start
{
    /**
     * 接受回调处理
     * @todo 无
     * @author 小黄牛
     * @version v1.1.4 + 2020.07.12
     * @deprecated 暂不启用
     * @global 无
     * @return bool
    */
    public function run() {
        // 这里可以做些业务重新初始化的工作
        
        return true;
    }
}