<?php
/**
 * +----------------------------------------------------------------------
 * Elasticsearch节点配置
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/

return [
    // 节点配置
    'node' => [
        // [
        //     'host' => 'http://127.0.0.1:9500', // 请求地址
        //     'user' => '', // 账号
        //     'pass' => '', // 密码
        //     'ssl_path' => '', // 签名证书绝对地址
        // ],
    ],
    // 正常节点嗅探的间隔时间(S)
    'normal_sniff_interval_time' => 10,
    // 故障节点嗅探的间隔时间(S)
    'fault_sniff_interval_time' => 10,
    // 默认节点重试最大次数
    'retry_max_num' => 5,
    // API CURL的最大超时时间(S)
    'client_send_outtime' => 5,
    // ES Write时的最大超时控制
    'es_write_outtime' => '5m',
];
