<?php
/**
 * +----------------------------------------------------------------------
 * 限流器配置
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/

return [
    // +-----------------------------
    // | 基于-路由限流
    // +-----------------------------
    'route' => [
        // 限流开关 true.开  false.关
        'limit_switch' => false,
        // 是否全部路由开启 true.开  false.关
        'global_switch' => false,
        // 统计器重置间隔时间【理解为每次统计的间隔时间】
        'reset_time' => 1,
        // 限流峰值
        'peak_num' => 60,
    ],

    // +-----------------------------
    // | 基于-IP限流
    // +-----------------------------
    'ip' => [
        // 限流开关 true.开  false.关
        'limit_switch' => false,
        // 是否全部路由开启 true.开  false.关 【不建议开启，因为开启该选项会导致每个IP都会加入统计器，很消耗内存】
        'global_switch' => false,
        // 统计器重置间隔时间【理解为每次统计的间隔时间】
        'reset_time' => 1,
        // 限流峰值
        'peak_num' => 60,
    ],
];