<?php
/**
 * +----------------------------------------------------------------------
 * MQTT服务配置
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/

return [
    // +-----------------------------
    // | 服务端
    // +-----------------------------
    // 账号
    'user_name' => 'swoolex',
    // 密码
    'password' => 'swoolex',
    // 版本
    'protocol_level' => 3, // 支持传入3 | 5
    // 设备最大同时在线数
    'device_max_num' => 100000,
    // 判断设备心跳过期时间(S)
    'ping_max_time' => 120,
    // 设备在线状态定时检测间隔时间(S)
    'ping_crontab_time' => 20,
    // 客户端消息发布事件，是否允许使用 # + 通配符
    'publish_wildcard_status' => true,
];