<?php
// +----------------------------------------------------------------------
// | HTTP路由配置
// +----------------------------------------------------------------------
// | Copyright (c) 2018 https://blog.junphp.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 小黄牛 <1731223728@qq.com>
// +----------------------------------------------------------------------

return [
    // 路模式 1.path_info模式  2.路由表匹配模式  3.兼容模式
    'pattern' => 3,
    // 路由分隔符
    'cutting' => '/',
    // 路由伪后缀
    'suffix' => '.html',
    // 找不到路由的时候，是否启用自定义的错误处理程序
    '404' => true,
    // 自定义的错误处理程序，只需要提供一个类的命名空间位置即可，会把基类Controller的obj注入到第一个参数中，调用fetch即可抛出内容
    'error_class' => '\\app\\error',
];
