<?php
/**
 * +----------------------------------------------------------------------
 * HTTP路由配置
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/

return [
    // 路由分隔符
    'cutting' => '/',
    // 路由伪后缀
    'suffix' => '.html',
    // 找不到路由的时候，是否启用自定义的错误处理程序
    '404' => true,
    // 自定义的错误处理程序，只需要提供一个类的命名空间位置即可，会把基类Controller的obj注入到第一个参数中，调用fetch即可抛出内容
    'error_class' => '\\box\\http_error',
];
