<?php
/**
 * +----------------------------------------------------------------------
 * Mqtt密码器-抽象类
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/
namespace design;

abstract class AbstractMqttCipher {
    
    /**
     * 必须实现的密码器入口方法
     * @author 小黄牛
     * @version v2.5.1 + 2021.08.20
     * @param array $data 连接请求参数
    */
    abstract public function run($data);
}