<?php
/**
 * +----------------------------------------------------------------------
 * 节点信息接口类
 * +----------------------------------------------------------------------
 * 官网：https://www.sw-x.cn
 * +----------------------------------------------------------------------
 * 作者：小黄牛 <1731223728@qq.com>
 * +----------------------------------------------------------------------
 * 开源协议：http://www.apache.org/licenses/LICENSE-2.0
 * +----------------------------------------------------------------------
*/
namespace x\elasticsearch\connections;

interface ConnectionInterface
{
    // 获取节点配置
    public function getNode();

    // 获取请求头配置
    public function getHeader();
}
