<?php
// +----------------------------------------------------------------------
// | 控制器
// +----------------------------------------------------------------------
// | Copyright (c) 2018 https://blog.junphp.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 小黄牛 <1731223728@qq.com>
// +----------------------------------------------------------------------

namespace app\rpc\order;

class create {

    // rpc - order/create->run()服务
    public function run() {
        // 请求参数
        var_dump($this->param);
        // 请求头
        var_dump($this->headers);
        // 返回值
        return ['id' => 1];
    }
    
}

